#   Выполнение практического задания по уроку "Динамическая типизация"
#   Студент: Костромин Александр Анатольевич
#
#   Решение задачи "Длина слова":
#
# Создадим переменную name и присваевоим ей значение нашего имени (строка)
name = 'Alexandr'
#
# Вывeдим значение переменной name на экран.
print('Name: ' + name)
#
# Создадим переменную age и присвоим ей значение нашего возраста (целое число).
age = 60
#
# Вывeдим значение переменной age на экран.
print('Age: ' + str(age))
#
# Перезапишем в age текущее значение переменной age + новое.
age = age + 1
#
# Выведим измененное значение переменной age на экран.
print('New age: ' + str(age))
#
# Создадим переменную is_student и присвоим ей значение True (логическое значение).
is_student = True
#
# Выведим значение переменной is_student на экран.
print('Is Student: ' + str(is_student))
