#   Выполнение практического задания по уроку "Базовые структуры данных"
#   Студент: Костромин Александр Анатольевич
#
#   Решение задачи "Длина слова":
#
a = "Начинаем обучение. Ура!"  # записываем в переменную "а" строку
print(len(a))                  # выводим на экран результат, вычесленный функцией "len"
#
#
#   Решение задачи "Суммы и разности":
#
first = 10
second = 20
summa = first + second
diff = first - second
print(summa, diff)
#
#
#   Решение задачи "Среднее арифметическое":
#
first = 10
second = 20
third = 30
mean = (first + second + third)//3
print(mean)
#
#
#   Решение задачи "Простые строчки":
#
first_string = 'Вторник'
second_string = 'Понедельник'
print(second_string + ', ' + first_string)
#
#
#   Решение задачи "Сложная формула":
a = 10
b = 20
c = 30
f = (a*b) + (a*c)
f = f**3
f = f/2
print(f)
#
#
